In [150]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

A seires is a one-dimensional labeled array capable of holding any data type
Series Example:

In [151]:
obj = pd.Series([4, 7, -5, 3])

obj

0    4
1    7
2   -5
3    3
dtype: int64

The string representation of the series shows the index (range index), followed by the values.
Because to index is specified a default index is given.

Below is a series with an index:

In [152]:
obj2 = pd.Series([4, 7, -5, 3], index=['a','b','c','d'])

obj2

a    4
b    7
c   -5
d    3
dtype: int64

In [153]:
obj2 * 2

a     8
b    14
c   -10
d     6
dtype: int64

In [154]:
obj2[obj2 > 0]

a    4
b    7
d    3
dtype: int64

We can apply mathematical operations to series as seen above on obj2.

A series is like a fixed length ordered dictionary.
A dictionary can easily be converted to a series.
And vice versa.

In [155]:
np.mean(obj2)

2.25

Numpy funtions can be applied to series.

DataFrame is a two-dimensional labeled data structure with columns of potentially different types.

When making a dtataframe out of a dictionary, the keys become column names and the values become the data.

In [156]:
my_dict = {"name" : ["John", "Doe", "Jane"],
           "age" : np.array([25, 30, 28]),
           "weight" : (70, 80, 65),
           "height" : pd.Series([4.5, 5.0, 4.8], index = ["John", "Doe", "Jane"]),
           "siblings" : 1,
           "gender" : "M"}

df = pd.DataFrame(my_dict)

df

      name  age  weight  height  siblings gender
John  John   25      70     4.5         1      M
Doe    Doe   30      80     5.0         1      M
Jane  Jane   28      65     4.8         1      M

All for datatypes are capable of being stored in a DataFrame.
If one of you data columns is a pandas series that alredy has an index, pandas will use that index for the dataframe.

My_dict2 uses a list of height instead of a pandas series, it will also have a different index.

In [157]:
my_dict2 = {"name" : ["John", "Doe", "Jane"],
           "age" : np.array([25, 30, 28]),
           "weight" : (70, 80, 65),
           "height" : [4.5, 5.0, 4.8],
           "siblings" : 1,
           "gender" : "M"}

df2 = pd.DataFrame(my_dict2)

df2

   name  age  weight  height  siblings gender
0  John   25      70     4.5         1      M
1   Doe   30      80     5.0         1      M
2  Jane   28      65     4.8         1      M

In [158]:


df2 = pd.DataFrame(my_dict2, index = my_dict["name"])

df2

      name  age  weight  height  siblings gender
John  John   25      70     4.5         1      M
Doe    Doe   30      80     5.0         1      M
Jane  Jane   28      65     4.8         1      M

Df2 gets its index from the name column in my_dict.
Dataframes behave like a dictionary of Series objects that each have the same length and indices.

In [159]:
#Get a specific column by name
df2["weight"]

John    70
Doe     80
Jane    65
Name: weight, dtype: int64

In [160]:
#Get a specific column by name using dot notation
df2.weight

John    70
Doe     80
Jane    65
Name: weight, dtype: int64

In [161]:
#delete a column
del df2['name']

In [162]:
#Add a new column
df2["IQ"] = [130,105,115]
df2

      age  weight  height  siblings gender   IQ
John   25      70     4.5         1      M  130
Doe    30      80     5.0         1      M  105
Jane   28      65     4.8         1      M  115

Ensure that the new column has the same length as the DataFrame or else it will raise a ValueError or fill in all values with the same value if a single value is provided. An example is provided below:

In [163]:
df2["married"] = False

df2

      age  weight  height  siblings gender   IQ  married
John   25      70     4.5         1      M  130    False
Doe    30      80     5.0         1      M  105    False
Jane   28      65     4.8         1      M  115    False

In [164]:
df2["College"] = pd.Series(["Harvard"], index=["Jane"])

df2

      age  weight  height  siblings gender   IQ  married  College
John   25      70     4.5         1      M  130    False      NaN
Doe    30      80     5.0         1      M  105    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

When inserting a series into a DataFrame, rows are matched by index any missing index values will be filled with NaN.

You can select both rows or columns by label with df.loc[row_label, column_label] as seen below:

In [165]:
df2.loc["John"]

age            25
weight         70
height        4.5
siblings        1
gender          M
IQ            130
married     False
College       NaN
Name: John, dtype: object

In [166]:
df2.loc["John","IQ"]

130

In [167]:
df2.loc["John": "Doe", "IQ": "College"] #slice by rows and columns

       IQ  married College
John  130    False     NaN
Doe   105    False     NaN

You can also select rows or columns by position with df.iloc[row_index, column_] as seen below:
This is useful for locating row that were never explicitly labeled.

In [169]:
df2.iloc[0]

age            25
weight         70
height        4.5
siblings        1
gender          M
IQ            130
married     False
College       NaN
Name: John, dtype: object

In [ ]:
df2.iloc[0:2, 5:8] #slice by rows and columns

In [170]:
booolean_index = [True, False, True] #this will only return rows where the boolean index is True
df2[booolean_index] #slice by rows based on a boolean index

      age  weight  height  siblings gender   IQ  married  College
John   25      70     4.5         1      M  130    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

Logical boolean indexing us useful for subsetting data based on certain conditions. For example to get all rows where the age is greater than 25:

In [171]:
boolean_index = df2["age"] > 25

df2[boolean_index]

      age  weight  height  siblings gender   IQ  married  College
Doe    30      80     5.0         1      M  105    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

You can do this all in one operation as seen below:

In [172]:
df2[df2["age"] > 25]

      age  weight  height  siblings gender   IQ  married  College
Doe    30      80     5.0         1      M  105    False      NaN
Jane   28      65     4.8         1      M  115    False  Harvard

Exploring data

Most times when you get a dataframe, its not going to be something you made in python its going to be read from a file, or scraped from a website.

Your going to need to know some basic functions to explore your data.